kv_ycsb_hash.log
./kv/release/tests/db/kv_bench --cache_size=8388608 --db=/mnt/shunzi/test-data/wipdb/kv_ycsb --threads=8 --open_files=40000 --num=100000000 --range=100000000 --reads=2000000 --partition=100 --write_buffer_size=2097152 --batch_size=1000 --stats_interval=1000000 --bloom_bits=16 --low_pool=3 --high_pool=3 --value_size=100 --direct_io=false --histogram=true --log=true --skiplistrep=false --benchmarks=loadreverse,ycsba,ycsbb,ycsbc,ycsbf,ycsbd,stats --ycsb_ops_num=8000000 --seek_nexts=100 --use_existing_db=true --print_wa=true --log_dio=true --hugepage=true 
Bench num: 100000000, range: 100000000
Keys:       16 bytes each
Values:     100 bytes each (50 bytes after compression)
Entries:    100000000
RawSize:    11062.6 MB (estimated)
FileSize:   6294.3 MB (estimated)
WARNING: Snappy compression is not enabled
------------------------------------------------
Write buffer: 2048.00 KB. Compression: 0. 
Restore 100 pivots
Recover seq# 120002000, log# 143, min log#140026612649984, file# 11863
using restored pivots
Log_Recover_Time, 0.0000, BucketCount, 100 , Log_size, 0.0 ,MB
loadreverse  : 4162003.000 micros/op 0 ops/sec;
Microseconds per op:
Count: 0 Average: 0.0000  StdDev: 0.00
Min: 0  Median: 0.0000  Max: 0
Percentiles: P50: 0.00 P75: 0.00 P99: 0.00 P99.9: 0.00 P99.99: 0.00
------------------------------------------------------

2022/06/30-15:09:26  ... thread 3: (1000000,1000000) ops and (23527.8,23527.8) ops/second in (42.502916,42.502916) seconds
2022/06/30-15:09:26  ... thread 1: (1000000,1000000) ops and (23470.5,23470.5) ops/second in (42.606649,42.606649) seconds
2022/06/30-15:09:26  ... thread 4: (1000000,1000000) ops and (23447.8,23447.8) ops/second in (42.647938,42.647938) seconds
2022/06/30-15:09:26  ... thread 6: (1000000,1000000) ops and (23391.5,23391.5) ops/second in (42.750620,42.750620) seconds
2022/06/30-15:09:26  ... thread 2: (1000000,1000000) ops and (23348.6,23348.6) ops/second in (42.829138,42.829138) seconds
2022/06/30-15:09:27  ... thread 7: (1000000,1000000) ops and (23157.7,23157.7) ops/second in (43.182254,43.182254) seconds
2022/06/30-15:09:27  ... thread 5: (1000000,1000000) ops and (23194.5,23194.5) ops/second in (43.113732,43.113732) seconds
2022/06/30-15:09:27  ... thread 0: (1000000,1000000) ops and (22965.8,22965.8) ops/second in (43.543024,43.543024) seconds
2022/06/30-15:09:48  ... thread 1: (1000000,2000000) ops and (46214.5,31130.9) ops/second in (21.638248,64.244897) seconds
2022/06/30-15:09:48  ... thread 4: (1000000,2000000) ops and (45718.4,30997.7) ops/second in (21.873055,64.520993) seconds
2022/06/30-15:09:48  ... thread 6: (1000000,2000000) ops and (45704.0,30945.1) ops/second in (21.879900,64.630520) seconds
2022/06/30-15:09:48  ... thread 3: (1000000,2000000) ops and (45335.8,30978.7) ops/second in (22.057640,64.560556) seconds
2022/06/30-15:09:49  ... thread 2: (1000000,2000000) ops and (44435.1,30612.0) ops/second in (22.504720,65.333858) seconds
2022/06/30-15:09:49  ... thread 5: (1000000,2000000) ops and (45022.6,30616.2) ops/second in (22.211089,65.324821) seconds
2022/06/30-15:09:49  ... thread 7: (1000000,2000000) ops and (44843.4,30542.7) ops/second in (22.299841,65.482095) seconds
2022/06/30-15:09:49  ... thread 0: (1000000,2000000) ops and (44946.5,30399.0) ops/second in (22.248695,65.791719) seconds
2022/06/30-15:10:09  ... thread 1: (1000000,3000000) ops and (45991.3,34888.5) ops/second in (21.743266,85.988163) seconds
2022/06/30-15:10:10  ... thread 6: (1000000,3000000) ops and (46104.3,34754.2) ops/second in (21.689934,86.320454) seconds
2022/06/30-15:10:10  ... thread 3: (1000000,3000000) ops and (46021.5,34766.7) ops/second in (21.728996,86.289552) seconds
2022/06/30-15:10:10  ... thread 4: (1000000,3000000) ops and (45573.6,34696.7) ops/second in (21.942552,86.463545) seconds
2022/06/30-15:10:11  ... thread 7: (1000000,3000000) ops and (44785.2,34164.3) ops/second in (22.328827,87.810922) seconds
2022/06/30-15:10:11  ... thread 5: (1000000,3000000) ops and (44246.8,34119.9) ops/second in (22.600490,87.925311) seconds
2022/06/30-15:10:11  ... thread 2: (1000000,3000000) ops and (44082.6,34083.7) ops/second in (22.684693,88.018551) seconds
2022/06/30-15:10:12  ... thread 0: (1000000,3000000) ops and (44467.6,33982.8) ops/second in (22.488297,88.280016) seconds
2022/06/30-15:10:31  ... thread 1: (1000000,4000000) ops and (46957.9,37284.3) ops/second in (21.295659,107.283822) seconds
2022/06/30-15:10:31  ... thread 3: (1000000,4000000) ops and (46888.3,37168.9) ops/second in (21.327283,107.616835) seconds
2022/06/30-15:10:31  ... thread 4: (1000000,4000000) ops and (46783.8,37092.5) ops/second in (21.374907,107.838452) seconds
2022/06/30-15:10:31  ... thread 6: (1000000,4000000) ops and (45867.9,36995.2) ops/second in (21.801763,108.122217) seconds
2022/06/30-15:10:33  ... thread 5: (1000000,4000000) ops and (46174.0,36502.2) ops/second in (21.657222,109.582533) seconds
2022/06/30-15:10:33  ... thread 7: (1000000,4000000) ops and (45694.2,36464.6) ops/second in (21.884600,109.695522) seconds
2022/06/30-15:10:33  ... thread 0: (1000000,4000000) ops and (46318.7,36406.8) ops/second in (21.589560,109.869576) seconds
2022/06/30-15:10:34  ... thread 2: (1000000,4000000) ops and (44988.3,36282.3) ops/second in (22.228001,110.246552) seconds
2022/06/30-15:10:52  ... thread 1: (1000000,5000000) ops and (47504.7,38960.7) ops/second in (21.050560,128.334382) seconds
2022/06/30-15:10:52  ... thread 4: (1000000,5000000) ops and (47238.1,38757.3) ops/second in (21.169351,129.007803) seconds
2022/06/30-15:10:52  ... thread 3: (1000000,5000000) ops and (46700.4,38750.7) ops/second in (21.413114,129.029949) seconds
2022/06/30-15:10:53  ... thread 6: (1000000,5000000) ops and (46806.4,38614.0) ops/second in (21.364598,129.486815) seconds
2022/06/30-15:10:55  ... thread 5: (1000000,5000000) ops and (46366.9,38124.4) ops/second in (21.567121,131.149654) seconds
2022/06/30-15:10:55  ... thread 0: (1000000,5000000) ops and (46292.5,38031.1) ops/second in (21.601781,131.471357) seconds
2022/06/30-15:10:55  ... thread 7: (1000000,5000000) ops and (45843.3,38020.2) ops/second in (21.813459,131.508981) seconds
2022/06/30-15:10:55  ... thread 2: (1000000,5000000) ops and (46700.7,37976.8) ops/second in (21.412949,131.659501) seconds
2022/06/30-15:11:14  ... thread 1: (1000000,6000000) ops and (45510.3,39918.2) ops/second in (21.973030,150.307412) seconds
2022/06/30-15:11:14  ... thread 4: (1000000,6000000) ops and (45927.2,39792.7) ops/second in (21.773581,150.781384) seconds
2022/06/30-15:11:14  ... thread 3: (1000000,6000000) ops and (45692.7,39757.4) ops/second in (21.885357,150.915306) seconds
2022/06/30-15:11:15  ... thread 6: (1000000,6000000) ops and (45240.1,39580.2) ops/second in (22.104298,151.591113) seconds
2022/06/30-15:11:17  ... thread 5: (1000000,6000000) ops and (45190.4,39144.5) ops/second in (22.128585,153.278239) seconds
2022/06/30-15:11:17  ... thread 7: (1000000,6000000) ops and (45279.9,39064.1) ops/second in (22.084860,153.593841) seconds
2022/06/30-15:11:17  ... thread 0: (1000000,6000000) ops and (44632.1,38992.2) ops/second in (22.405413,153.876770) seconds
2022/06/30-15:11:18  ... thread 2: (1000000,6000000) ops and (44415.0,38917.0) ops/second in (22.514926,154.174427) seconds
2022/06/30-15:11:35  ... thread 4: (1000000,7000000) ops and (47337.2,40719.8) ops/second in (21.125037,171.906421) seconds
2022/06/30-15:11:35  ... thread 3: (1000000,7000000) ops and (47374.5,40692.1) ops/second in (21.108405,172.023711) seconds
2022/06/30-15:11:36  ... thread 1: (1000000,7000000) ops and (45945.0,40680.5) ops/second in (21.765162,172.072574) seconds
2022/06/30-15:11:36  ... thread 6: (1000000,7000000) ops and (46427.6,40432.0) ops/second in (21.538916,173.130029) seconds
2022/06/30-15:11:38  ... thread 7: (1000000,7000000) ops and (47699.0,40101.1) ops/second in (20.964779,174.558620) seconds
2022/06/30-15:11:39  ... thread 5: (1000000,7000000) ops and (45986.8,39994.6) ops/second in (21.745375,175.023614) seconds
2022/06/30-15:11:39  ... thread 0: (1000000,7000000) ops and (45765.8,39834.5) ops/second in (21.850372,175.727142) seconds
2022/06/30-15:11:39  ... thread 2: (1000000,7000000) ops and (46781.9,39874.6) ops/second in (21.375785,175.550212) seconds
2022/06/30-15:11:57  ... thread 3: (1000000,8000000) ops and (45811.0,41268.5) ops/second in (21.828840,193.852551) seconds
2022/06/30-15:11:57  ... thread 4: (1000000,8000000) ops and (45413.9,41252.8) ops/second in (22.019706,193.926127) seconds
2022/06/30-15:11:57  ... thread 1: (1000000,8000000) ops and (45777.3,41254.7) ops/second in (21.844912,193.917486) seconds
2022/06/30-15:11:58  ... thread 6: (1000000,8000000) ops and (46750.4,41126.8) ops/second in (21.390172,194.520201) seconds
2022/06/30-15:11:59  ... thread 7: (1000000,8000000) ops and (46941.6,40845.1) ops/second in (21.303071,195.861691) seconds
2022/06/30-15:12:00  ... thread 5: (1000000,8000000) ops and (47139.6,40767.0) ops/second in (21.213578,196.237192) seconds
2022/06/30-15:12:00  ... thread 2: (1000000,8000000) ops and (47731.2,40712.3) ops/second in (20.950642,196.500854) seconds
2022/06/30-15:12:00  ... thread 0: (1000000,8000000) ops and (47230.9,40629.8) ops/second in (21.172593,196.899735) seconds
ycsba        :       3.077 micros/op 325037 ops/sec;   36.0 MB/s (3999997 of 8000000 found)
Microseconds per op:
Count: 64000000 Average: 24.4018  StdDev: 57.96
Min: 0  Median: 17.8865  Max: 345333
Percentiles: P50: 17.89 P75: 22.15 P99: 76.49 P99.9: 769.92 P99.99: 12233.20
------------------------------------------------------
[       0,       1 ]    45643   0.071%   0.071% 
(       1,       2 ]    72551   0.113%   0.185% 
(       2,       3 ]   150316   0.235%   0.420% 
(       3,       4 ]   379707   0.593%   1.013% 
(       4,       6 ]   964766   1.507%   2.520% 
(       6,      10 ]  3753945   5.866%   8.386% #
(      10,      15 ] 15524932  24.258%  32.644% #####
(      15,      22 ] 26938358  42.091%  74.735% ########
(      22,      34 ] 13953168  21.802%  96.537% ####
(      34,      51 ]  1427926   2.231%  98.768% 
(      51,      76 ]   146625   0.229%  98.997% 
(      76,     110 ]   143336   0.224%  99.221% 
(     110,     170 ]   258107   0.403%  99.624% 
(     170,     250 ]    90294   0.141%  99.765% 
(     250,     380 ]    34323   0.054%  99.819% 
(     380,     580 ]    30778   0.048%  99.867% 
(     580,     870 ]    32409   0.051%  99.917% 
(     870,    1300 ]    22071   0.034%  99.952% 
(    1300,    1900 ]     8780   0.014%  99.966% 
(    1900,    2900 ]     2736   0.004%  99.970% 
(    2900,    4400 ]     1577   0.002%  99.972% 
(    4400,    6600 ]     1321   0.002%  99.974% 
(    6600,    9900 ]     3097   0.005%  99.979% 
(    9900,   14000 ]    12009   0.019%  99.998% 
(   14000,   22000 ]      787   0.001%  99.999% 
(   22000,   33000 ]      140   0.000% 100.000% 
(   33000,   50000 ]      161   0.000% 100.000% 
(   50000,   75000 ]       80   0.000% 100.000% 
(   75000,  110000 ]       17   0.000% 100.000% 
(  110000,  170000 ]       27   0.000% 100.000% 
(  170000,  250000 ]        5   0.000% 100.000% 
(  250000,  380000 ]        8   0.000% 100.000% 

2022/06/30-15:12:25  ... thread 2: (1000000,1000000) ops and (46066.0,46066.0) ops/second in (21.707964,21.707964) seconds
2022/06/30-15:12:25  ... thread 5: (1000000,1000000) ops and (44201.7,44201.7) ops/second in (22.623566,22.623566) seconds
2022/06/30-15:12:25  ... thread 1: (1000000,1000000) ops and (45656.7,45656.7) ops/second in (21.902568,21.902568) seconds
2022/06/30-15:12:25  ... thread 6: (1000000,1000000) ops and (45508.4,45508.4) ops/second in (21.973956,21.973956) seconds
2022/06/30-15:12:26  ... thread 7: (1000000,1000000) ops and (43270.4,43270.4) ops/second in (23.110509,23.110509) seconds
2022/06/30-15:12:26  ... thread 4: (1000000,1000000) ops and (43520.8,43520.8) ops/second in (22.977510,22.977510) seconds
2022/06/30-15:12:26  ... thread 3: (1000000,1000000) ops and (42753.0,42753.0) ops/second in (23.390197,23.390197) seconds
2022/06/30-15:12:27  ... thread 0: (1000000,1000000) ops and (42538.8,42538.8) ops/second in (23.507947,23.507947) seconds
2022/06/30-15:12:48  ... thread 1: (1000000,2000000) ops and (44663.1,45154.5) ops/second in (22.389839,44.292407) seconds
2022/06/30-15:12:48  ... thread 2: (1000000,2000000) ops and (44297.9,45164.6) ops/second in (22.574459,44.282423) seconds
2022/06/30-15:12:48  ... thread 6: (1000000,2000000) ops and (44204.4,44846.9) ops/second in (22.622179,44.596135) seconds
2022/06/30-15:12:48  ... thread 5: (1000000,2000000) ops and (43724.3,43961.7) ops/second in (22.870574,45.494140) seconds
2022/06/30-15:12:49  ... thread 3: (1000000,2000000) ops and (43942.7,43339.6) ops/second in (22.756924,46.147121) seconds
2022/06/30-15:12:49  ... thread 4: (1000000,2000000) ops and (43037.6,43277.8) ops/second in (23.235517,46.213027) seconds
2022/06/30-15:12:50  ... thread 7: (1000000,2000000) ops and (42388.5,42824.9) ops/second in (23.591305,46.701814) seconds
2022/06/30-15:12:50  ... thread 0: (1000000,2000000) ops and (43235.0,42884.1) ops/second in (23.129412,46.637359) seconds
2022/06/30-15:13:10  ... thread 1: (1000000,3000000) ops and (44280.8,44859.4) ops/second in (22.583174,66.875581) seconds
2022/06/30-15:13:10  ... thread 2: (1000000,3000000) ops and (43779.7,44693.4) ops/second in (22.841626,67.124049) seconds
2022/06/30-15:13:10  ... thread 6: (1000000,3000000) ops and (44401.1,44697.3) ops/second in (22.521943,67.118078) seconds
2022/06/30-15:13:12  ... thread 5: (1000000,3000000) ops and (41770.2,43206.1) ops/second in (23.940517,69.434657) seconds
2022/06/30-15:13:12  ... thread 4: (1000000,3000000) ops and (44409.7,43648.6) ops/second in (22.517625,68.730652) seconds
2022/06/30-15:13:13  ... thread 7: (1000000,3000000) ops and (42396.2,42681.0) ops/second in (23.587043,70.288857) seconds
2022/06/30-15:13:14  ... thread 0: (1000000,3000000) ops and (41984.8,42580.1) ops/second in (23.818116,70.455475) seconds
2022/06/30-15:13:14  ... thread 3: (1000000,3000000) ops and (40802.9,42459.7) ops/second in (24.508060,70.655181) seconds
2022/06/30-15:13:33  ... thread 2: (1000000,4000000) ops and (43296.7,44335.8) ops/second in (23.096474,90.220523) seconds
2022/06/30-15:13:34  ... thread 6: (1000000,4000000) ops and (43045.6,44272.6) ops/second in (23.231186,90.349264) seconds
2022/06/30-15:13:34  ... thread 1: (1000000,4000000) ops and (42434.8,44227.7) ops/second in (23.565579,90.441160) seconds
2022/06/30-15:13:35  ... thread 4: (1000000,4000000) ops and (42578.8,43376.2) ops/second in (23.485865,92.216517) seconds
2022/06/30-15:13:36  ... thread 5: (1000000,4000000) ops and (41883.8,42867.7) ops/second in (23.875602,93.310259) seconds
2022/06/30-15:13:37  ... thread 7: (1000000,4000000) ops and (41873.0,42476.1) ops/second in (23.881744,94.170601) seconds
2022/06/30-15:13:38  ... thread 0: (1000000,4000000) ops and (40570.0,42059.1) ops/second in (24.648738,95.104213) seconds
2022/06/30-15:13:38  ... thread 3: (1000000,4000000) ops and (40541.3,41963.3) ops/second in (24.666210,95.321391) seconds
2022/06/30-15:13:57  ... thread 2: (1000000,5000000) ops and (43289.5,44122.5) ops/second in (23.100279,113.320802) seconds
2022/06/30-15:13:57  ... thread 6: (1000000,5000000) ops and (43282.5,44071.0) ops/second in (23.104036,113.453300) seconds
2022/06/30-15:13:57  ... thread 1: (1000000,5000000) ops and (43118.7,44001.3) ops/second in (23.191789,113.632949) seconds
2022/06/30-15:13:59  ... thread 4: (1000000,5000000) ops and (43083.2,43317.3) ops/second in (23.210884,115.427401) seconds
2022/06/30-15:14:00  ... thread 5: (1000000,5000000) ops and (41576.1,42603.0) ops/second in (24.052278,117.362537) seconds
2022/06/30-15:14:01  ... thread 7: (1000000,5000000) ops and (41057.3,42184.6) ops/second in (24.356176,118.526777) seconds
2022/06/30-15:14:02  ... thread 3: (1000000,5000000) ops and (41471.0,41863.9) ops/second in (24.113229,119.434620) seconds
2022/06/30-15:14:03  ... thread 0: (1000000,5000000) ops and (39978.6,41625.9) ops/second in (25.013380,120.117593) seconds
2022/06/30-15:14:20  ... thread 2: (1000000,6000000) ops and (43471.5,44012.7) ops/second in (23.003551,136.324353) seconds
2022/06/30-15:14:20  ... thread 6: (1000000,6000000) ops and (43507.8,43976.1) ops/second in (22.984384,136.437684) seconds
2022/06/30-15:14:20  ... thread 1: (1000000,6000000) ops and (43643.4,43941.3) ops/second in (22.912964,136.545913) seconds
2022/06/30-15:14:22  ... thread 4: (1000000,6000000) ops and (42983.3,43261.2) ops/second in (23.264871,138.692272) seconds
2022/06/30-15:14:24  ... thread 5: (1000000,6000000) ops and (42180.4,42532.0) ops/second in (23.707671,141.070208) seconds
2022/06/30-15:14:24  ... thread 7: (1000000,6000000) ops and (44080.7,42489.2) ops/second in (22.685658,141.212435) seconds
2022/06/30-15:14:27  ... thread 3: (1000000,6000000) ops and (41451.0,41794.5) ops/second in (24.124888,143.559508) seconds
2022/06/30-15:14:28  ... thread 0: (1000000,6000000) ops and (40380.3,41413.0) ops/second in (24.764567,144.882160) seconds
2022/06/30-15:14:42  ... thread 6: (1000000,7000000) ops and (45092.3,44132.2) ops/second in (22.176750,158.614434) seconds
2022/06/30-15:14:42  ... thread 2: (1000000,7000000) ops and (44721.5,44112.6) ops/second in (22.360595,158.684948) seconds
2022/06/30-15:14:42  ... thread 1: (1000000,7000000) ops and (43989.3,43948.1) ops/second in (22.732806,159.278719) seconds
2022/06/30-15:14:44  ... thread 4: (1000000,7000000) ops and (44820.3,43477.3) ops/second in (22.311316,161.003588) seconds
2022/06/30-15:14:46  ... thread 5: (1000000,7000000) ops and (44005.7,42736.5) ops/second in (22.724330,163.794538) seconds
2022/06/30-15:14:48  ... thread 7: (1000000,7000000) ops and (41889.2,42402.4) ops/second in (23.872525,165.084960) seconds
2022/06/30-15:14:51  ... thread 3: (1000000,7000000) ops and (41434.9,41742.8) ops/second in (24.134251,167.693759) seconds
2022/06/30-15:14:51  ... thread 0: (1000000,7000000) ops and (42586.5,41576.6) ops/second in (23.481634,168.363794) seconds
2022/06/30-15:15:04  ... thread 1: (1000000,8000000) ops and (45458.2,44131.4) ops/second in (21.998235,181.276954) seconds
2022/06/30-15:15:05  ... thread 6: (1000000,8000000) ops and (44018.1,44117.9) ops/second in (22.717903,181.332337) seconds
2022/06/30-15:15:05  ... thread 2: (1000000,8000000) ops and (43433.7,44026.5) ops/second in (23.023614,181.708562) seconds
2022/06/30-15:15:06  ... thread 4: (1000000,8000000) ops and (46038.9,43781.8) ops/second in (21.720771,182.724359) seconds
2022/06/30-15:15:08  ... thread 5: (1000000,8000000) ops and (45136.0,43022.4) ops/second in (22.155272,185.949810) seconds
2022/06/30-15:15:10  ... thread 7: (1000000,8000000) ops and (45969.7,42817.7) ops/second in (21.753461,186.838421) seconds
2022/06/30-15:15:13  ... thread 3: (1000000,8000000) ops and (45654.5,42194.7) ops/second in (21.903625,189.597384) seconds
2022/06/30-15:15:13  ... thread 0: (1000000,8000000) ops and (46060.6,42088.8) ops/second in (21.710552,190.074346) seconds
ycsbb        :       2.979 micros/op 335719 ops/sec;   37.1 MB/s (7600000 of 8000000 found)
Microseconds per op:
Count: 64000000 Average: 23.1172  StdDev: 56.75
Min: 0  Median: 21.7886  Max: 28386
Percentiles: P50: 21.79 P75: 29.01 P99: 49.65 P99.9: 70.66 P99.99: 99.45
------------------------------------------------------
[       0,       1 ]   188266   0.294%   0.294% 
(       1,       2 ]   113724   0.178%   0.472% 
(       2,       3 ]    49239   0.077%   0.549% 
(       3,       4 ]   159861   0.250%   0.799% 
(       4,       6 ]   797396   1.246%   2.045% 
(       6,      10 ]  2837140   4.433%   6.478% #
(      10,      15 ]  6247064   9.761%  16.239% ##
(      15,      22 ] 22280102  34.813%  51.051% #######
(      22,      34 ] 26251633  41.018%  92.069% ########
(      34,      51 ]  4819211   7.530%  99.599% ##
(      51,      76 ]   244647   0.382%  99.982% 
(      76,     110 ]     7710   0.012%  99.994% 
(     110,     170 ]      832   0.001%  99.995% 
(     170,     250 ]      503   0.001%  99.996% 
(     250,     380 ]      135   0.000%  99.996% 
(     380,     580 ]      307   0.000%  99.997% 
(     580,     870 ]      114   0.000%  99.997% 
(     870,    1300 ]      117   0.000%  99.997% 
(    1300,    1900 ]      116   0.000%  99.997% 
(    1900,    2900 ]      107   0.000%  99.997% 
(    2900,    4400 ]      127   0.000%  99.997% 
(    4400,    6600 ]      146   0.000%  99.998% 
(    6600,    9900 ]      450   0.001%  99.998% 
(    9900,   14000 ]      963   0.002% 100.000% 
(   14000,   22000 ]       74   0.000% 100.000% 
(   22000,   33000 ]       16   0.000% 100.000% 

2022/06/30-15:15:39  ... thread 7: (1000000,1000000) ops and (42876.9,42876.9) ops/second in (23.322594,23.322594) seconds
2022/06/30-15:15:39  ... thread 0: (1000000,1000000) ops and (42909.3,42909.3) ops/second in (23.304998,23.304998) seconds
2022/06/30-15:15:39  ... thread 3: (1000000,1000000) ops and (42689.7,42689.7) ops/second in (23.424865,23.424865) seconds
2022/06/30-15:15:40  ... thread 4: (1000000,1000000) ops and (42487.5,42487.5) ops/second in (23.536322,23.536322) seconds
2022/06/30-15:15:40  ... thread 5: (1000000,1000000) ops and (41524.7,41524.7) ops/second in (24.082030,24.082030) seconds
2022/06/30-15:15:40  ... thread 6: (1000000,1000000) ops and (42309.4,42309.4) ops/second in (23.635389,23.635389) seconds
2022/06/30-15:15:40  ... thread 1: (1000000,1000000) ops and (41658.9,41658.9) ops/second in (24.004452,24.004452) seconds
2022/06/30-15:15:40  ... thread 2: (1000000,1000000) ops and (41442.9,41442.9) ops/second in (24.129583,24.129583) seconds
2022/06/30-15:16:01  ... thread 7: (1000000,2000000) ops and (45714.4,44250.2) ops/second in (21.874935,45.197529) seconds
2022/06/30-15:16:01  ... thread 6: (1000000,2000000) ops and (47146.4,44597.1) ops/second in (21.210547,44.845936) seconds
2022/06/30-15:16:01  ... thread 3: (1000000,2000000) ops and (45417.4,44011.3) ops/second in (22.018013,45.442878) seconds
2022/06/30-15:16:01  ... thread 4: (1000000,2000000) ops and (46356.1,44337.6) ops/second in (21.572123,45.108445) seconds
2022/06/30-15:16:02  ... thread 0: (1000000,2000000) ops and (44394.7,43639.3) ops/second in (22.525207,45.830205) seconds
2022/06/30-15:16:02  ... thread 2: (1000000,2000000) ops and (45556.6,43402.5) ops/second in (21.950697,46.080280) seconds
2022/06/30-15:16:02  ... thread 1: (1000000,2000000) ops and (45342.8,43422.9) ops/second in (22.054228,46.058680) seconds
2022/06/30-15:16:02  ... thread 5: (1000000,2000000) ops and (44267.2,42852.1) ops/second in (22.590083,46.672113) seconds
2022/06/30-15:16:23  ... thread 6: (1000000,3000000) ops and (45431.5,44871.8) ops/second in (22.011169,66.857105) seconds
2022/06/30-15:16:24  ... thread 4: (1000000,3000000) ops and (45295.9,44652.5) ops/second in (22.077061,67.185506) seconds
2022/06/30-15:16:24  ... thread 7: (1000000,3000000) ops and (44008.5,44169.4) ops/second in (22.722872,67.920401) seconds
2022/06/30-15:16:24  ... thread 3: (1000000,3000000) ops and (44526.4,44181.7) ops/second in (22.458596,67.901474) seconds
2022/06/30-15:16:24  ... thread 2: (1000000,3000000) ops and (45932.4,44214.3) ops/second in (21.771142,67.851422) seconds
2022/06/30-15:16:25  ... thread 1: (1000000,3000000) ops and (44669.8,43830.7) ops/second in (22.386499,68.445179) seconds
2022/06/30-15:16:25  ... thread 5: (1000000,3000000) ops and (44560.1,43406.7) ops/second in (22.441591,69.113704) seconds
2022/06/30-15:16:26  ... thread 0: (1000000,3000000) ops and (41798.4,43007.9) ops/second in (23.924360,69.754565) seconds